00002-javascript-the-good-parts.org
#+TITLE: JavaScript: The Good Parts
#+SETUPFILE: theme.setup
#+INCLUDE: ./nav.org

* 前言 / Preface
- Douglas Crockford
- [[https://book.douban.com/subject/3590768/][JavaScript: The Good Parts]]
* 第 1 章 精华 / Good Parts
{{{begin-summary}}}
- class-free: 直接从其他对象继承属性
{{{end-summary}}}
** 为什么是 JAVASCRIPT?
** 分析 JAVASCRIPT
** 一个简单的试验场 / A Simple Testing Ground
* 第 2 章 语法 / Grammer
{{{begin-summary}}}
- railroad diagram
{{{end-summary}}}
** 空白 / Whitespace
- NaN 是一个数值并且不等于任何一个数值, 且不等于自己 (这个很合理), 用 ~isNan(num)~ 来测试
** 标识符 / Names
** 数字 / Numbers
** 字符串 / Strings
- 16 位 Unicode, ~"A" === "\u0041"~
- string.length
** 语句 / Statements
- falsy
  + ~false/null~
  + ~undefined~
  + " " (space)
  + ~0~
  + ~NaN~
** 表达式 / Expressions
- typeof:
  + number
  + string
  + boolean
  + undefined
  + function
  + object: 包括 array, ~null~
** 字面量 / Literals
** 函数 / Functions
* 第 3 章 对象 / Objects
{{{begin-summary}}}
- 属性值可以是 undefined 之外任何值
- 原型链
{{{end-summary}}}
** 对象字面量 / Object Literals
** 检索 / Retrieval
- 用短路语句避免对 null 找属性
** 更新 / Update
** 引用 / Reference
** 原型 / Prototype                                                    :best:
- Object.prototype
  #+BEGIN_SRC js
    if (typeof Object.create !== 'function') {
        Object.create = function (o) {
            var F = function () {};
            F.prototype = o;
            return new F();
        }
    }
  #+END_SRC
- 一层一层从 ~.proto~ 找, 直到 Object.
** 反射 / Reflection
- typeof flight.constructor ('function')
- flight.hasOwnProperty(prop)
** 枚举 / Enumeration
- for (prop in flight)
** 删除 / Delete
- delete flight.name (set to ~undefined~), 如果是数组, 形成空洞
** 减少全局变量污染 / Global Abatement
- 通过绑定到属性的方法, 把一堆杂七杂八的变量统领到一个变量下
* 第 4 章 函数 / Functions
{{{begin-summary}}}
- 编程: 把需求分解成一组函数与数据结果的技能.
{{{end-summary}}}
** 函数对象 / Function Objects
- 函数就是对象
- Function.prototype -> Object.prototype
** 函数字面量 / Function Literals
- 通过函数字面量创建的函数对象包含一个连到外部上下文的连接. Closure.
