00002-javascript-the-good-parts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>JavaScript: The Good Parts</title>
<!-- 2017-10-02 Mon 22:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="TANG ZhiXiong" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="css/github-gist.min.css">
<link rel="stylesheet" type="text/css" href="css/main.css"/>
</head>
<body>
<div id="content">
<h1 class="title">JavaScript: The Good Parts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. ☰</a>
<ul>
<li><a href="#sec-1-1">1.1. Meta Notes</a></li>
<li><a href="#sec-1-2">1.2. Books</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 前言 / Preface</a></li>
<li><a href="#sec-3">3. 第 1 章 精华 / Good Parts</a>
<ul>
<li><a href="#sec-3-1">3.1. 为什么是 JAVASCRIPT?</a></li>
<li><a href="#sec-3-2">3.2. 分析 JAVASCRIPT</a></li>
<li><a href="#sec-3-3">3.3. 一个简单的试验场 / A Simple Testing Ground</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 第 2 章 语法 / Grammer</a>
<ul>
<li><a href="#sec-4-1">4.1. 空白 / Whitespace</a></li>
<li><a href="#sec-4-2">4.2. 标识符 / Names</a></li>
<li><a href="#sec-4-3">4.3. 数字 / Numbers</a></li>
<li><a href="#sec-4-4">4.4. 字符串 / Strings</a></li>
<li><a href="#sec-4-5">4.5. 语句 / Statements</a></li>
<li><a href="#sec-4-6">4.6. 表达式 / Expressions</a></li>
<li><a href="#sec-4-7">4.7. 字面量 / Literals</a></li>
<li><a href="#sec-4-8">4.8. 函数 / Functions</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 第 3 章 对象 / Objects</a>
<ul>
<li><a href="#sec-5-1">5.1. 对象字面量 / Object Literals</a></li>
<li><a href="#sec-5-2">5.2. 检索 / Retrieval</a></li>
<li><a href="#sec-5-3">5.3. 更新 / Update</a></li>
<li><a href="#sec-5-4">5.4. 引用 / Reference</a></li>
<li><a href="#sec-5-5">5.5. 原型 / Prototype&#xa0;&#xa0;&#xa0;<span class="tag"><span class="best">best</span></span></a></li>
<li><a href="#sec-5-6">5.6. 反射 / Reflection</a></li>
<li><a href="#sec-5-7">5.7. 枚举 / Enumeration</a></li>
<li><a href="#sec-5-8">5.8. 删除 / Delete</a></li>
<li><a href="#sec-5-9">5.9. 减少全局变量污染 / Global Abatement</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 第 4 章 函数 / Functions</a>
<ul>
<li><a href="#sec-6-1">6.1. 函数对象 / Function Objects</a></li>
<li><a href="#sec-6-2">6.2. 函数字面量 / Function Literals</a></li>
<li><a href="#sec-6-3">6.3. 调用 / Invocation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="best">best</span></span></a></li>
<li><a href="#sec-6-4">6.4. 参数 / Arguments</a></li>
<li><a href="#sec-6-5">6.5. 返回 / Return</a></li>
<li><a href="#sec-6-6">6.6. 异常 / Exceptions</a></li>
<li><a href="#sec-6-7">6.7. 给类型增加方法 / Augmenting Types</a></li>
<li><a href="#sec-6-8">6.8. 递归 / Recursion</a></li>
<li><a href="#sec-6-9">6.9. 作用域 / Scope</a></li>
<li><a href="#sec-6-10">6.10. 闭包 / Closure</a></li>
<li><a href="#sec-6-11">6.11. 回调 / Callbacks</a></li>
<li><a href="#sec-6-12">6.12. 模块 / Module</a></li>
<li><a href="#sec-6-13">6.13. 级联 / Cascade</a></li>
<li><a href="#sec-6-14">6.14. 科里化 / Curry</a></li>
<li><a href="#sec-6-15">6.15. 记忆 / Memoization</a></li>
</ul>
</li>
<li><a href="#sec-7">7. 第 5 章 继承 / Inheritance</a>
<ul>
<li><a href="#sec-7-1">7.1. 伪类 / Pseudoclassical</a></li>
<li><a href="#sec-7-2">7.2. 对象说明符 / Object Specifiers</a></li>
<li><a href="#sec-7-3">7.3. 原型 / Prototypal</a></li>
<li><a href="#sec-7-4">7.4. 函数化 / Functional</a></li>
<li><a href="#sec-7-5">7.5. 部件 / Parts</a></li>
</ul>
</li>
<li><a href="#sec-8">8. 第 6 章 数组 / Arrays</a>
<ul>
<li><a href="#sec-8-1">8.1. 数组字面量 / Array Literals</a></li>
<li><a href="#sec-8-2">8.2. 长度 / Length</a></li>
<li><a href="#sec-8-3">8.3. 删除 / Delete</a></li>
<li><a href="#sec-8-4">8.4. 枚举 / Enumeration</a></li>
<li><a href="#sec-8-5">8.5. 混淆的地方 / Confusion</a></li>
<li><a href="#sec-8-6">8.6. 方法 / Methods</a></li>
<li><a href="#sec-8-7">8.7. 维度 / Dimensions</a></li>
</ul>
</li>
<li><a href="#sec-9">9. 第 7 章 正则表达式 / Regular Expressions</a>
<ul>
<li><a href="#sec-9-1">9.1. 一个例子 / An Example</a></li>
<li><a href="#sec-9-2">9.2. 结构 / Construction</a></li>
<li><a href="#sec-9-3">9.3. 元素 / Elements</a>
<ul>
<li><a href="#sec-9-3-1">9.3.1. 正则表达式分支 / Regexp Choice</a></li>
<li><a href="#sec-9-3-2">9.3.2. 正则表达式序列 / Regexp Sequence</a></li>
<li><a href="#sec-9-3-3">9.3.3. 正则表达式因子 / Regexp Factor</a></li>
<li><a href="#sec-9-3-4">9.3.4. 正则表达式转义 / Regexp Escape</a></li>
</ul>
</li>
<li><a href="#sec-9-4">9.4. 正则表达式分组 / Regexp Group</a></li>
</ul>
</li>
<li><a href="#sec-10">10. <span class="todo TODO">TODO</span> 第 8 章 方法</a></li>
<li><a href="#sec-11">11. 第 9 章 代码风格 / Style</a></li>
<li><a href="#sec-12">12. 第 10 章 优美的特性 / Beautiful Features</a></li>
<li><a href="#sec-13">13. 附录 A: 毒瘤 / Awful Parts</a></li>
<li><a href="#sec-14">14. 附录 B: 鸡肋 / Bad Parts</a></li>
<li><a href="#sec-15">15. 附录 C: JSLint</a></li>
<li><a href="#sec-16">16. 附录 D: 语法图</a></li>
<li><a href="#sec-17">17. 附录 E: JSON</a></li>
<li><a href="#sec-18">18. 索引</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ☰</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="./index.html">Main Entry</a>
</li>
</ul>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Meta Notes</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="./00001-emacs-org-mode.html">Emacs/Org-mode Notes</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Books</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="./00002-javascript-the-good-parts.html">JavaScript: The Good Parts</a>
</li>
<li><a href="./00003-effective-java.html">Effective Java</a>
</li>
<li><a href="./00004-domain-specific-languages.html">Domain Specific Languages</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 前言 / Preface</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Douglas Crockford
</li>
<li><a href="https://book.douban.com/subject/3590768/">JavaScript: The Good Parts</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 第 1 章 精华 / Good Parts</h2>
<div class="outline-text-2" id="text-3">
<div class="tzx-summary"><strong>Summary</strong>
<ul class="org-ul">
<li>class-free: 直接从其他对象继承属性
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 为什么是 JAVASCRIPT?</h3>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 分析 JAVASCRIPT</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 一个简单的试验场 / A Simple Testing Ground</h3>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 第 2 章 语法 / Grammer</h2>
<div class="outline-text-2" id="text-4">
<div class="tzx-summary"><strong>Summary</strong>
<ul class="org-ul">
<li>railroad diagram
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 空白 / Whitespace</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>NaN 是一个数值并且不等于任何一个数值, 且不等于自己 (这个很合理), 用 <code>isNan(num)</code> 来测试
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 标识符 / Names</h3>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 数字 / Numbers</h3>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 字符串 / Strings</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>16 位 Unicode, <code>"A" === "\u0041"</code>
</li>
<li>string.length
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 语句 / Statements</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>falsy
<ul class="org-ul">
<li><code>false/null</code>
</li>
<li><code>undefined</code>
</li>
<li>" " (space)
</li>
<li><code>0</code>
</li>
<li><code>NaN</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 表达式 / Expressions</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>typeof:
<ul class="org-ul">
<li>number
</li>
<li>string
</li>
<li>boolean
</li>
<li>undefined
</li>
<li>function
</li>
<li>object: 包括 array, <code>null</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> 字面量 / Literals</h3>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> 函数 / Functions</h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 第 3 章 对象 / Objects</h2>
<div class="outline-text-2" id="text-5">
<div class="tzx-summary"><strong>Summary</strong>
<ul class="org-ul">
<li>属性值可以是 undefined 之外任何值
</li>
<li>原型链
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 对象字面量 / Object Literals</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 检索 / Retrieval</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>用短路语句避免对 null 找属性
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 更新 / Update</h3>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 引用 / Reference</h3>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 原型 / Prototype&#xa0;&#xa0;&#xa0;<span class="tag"><span class="best">best</span></span></h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Object.prototype
<div class="org-src-container">

<pre class="src src-js">if (typeof Object.create !== 'function') {
    Object.create = function (o) {
        var F = function () {};
        F.prototype = o;
        return new F();
    }
}
</pre>
</div>
</li>
<li>一层一层从 <code>.proto</code> 找, 直到 Object.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 反射 / Reflection</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>typeof flight.constructor ('function')
</li>
<li>flight.hasOwnProperty(prop)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> 枚举 / Enumeration</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li>for (prop in flight)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> 删除 / Delete</h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li>delete flight.name (set to <code>undefined</code>), 如果是数组, 形成空洞
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> 减少全局变量污染 / Global Abatement</h3>
<div class="outline-text-3" id="text-5-9">
<ul class="org-ul">
<li>通过绑定到属性的方法, 把一堆杂七杂八的变量统领到一个变量下
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 第 4 章 函数 / Functions</h2>
<div class="outline-text-2" id="text-6">
<div class="tzx-summary"><strong>Summary</strong>
<ul class="org-ul">
<li>编程: 把需求分解成一组函数与数据结果的技能.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 函数对象 / Function Objects</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>函数就是对象
</li>
<li>Function.prototype -&gt; Object.prototype
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 函数字面量 / Function Literals</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>通过函数字面量创建的函数对象包含一个连到外部上下文的连接. Closure.
</li>
</ul>
</div>
</div>
