00002-javascript-the-good-parts.html
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 调用 / Invocation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="best">best</span></span></h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>两个额外参数: this 和 arguments (array-like, 只有 length 属性)
</li>
<li>缺失的参数 -&gt; undefined
</li>
<li>四种调用模式
<ul class="org-ul">
<li>The <b><b>Method</b></b> Invocation Pattern: 方法调用: object 的 (public) method 的调用. this 绑定到了对象.
</li>
<li>The <b><b>Function</b></b> Invocation Pattern: 函数调用: <code>var sum = add(3,4)</code>, this 绑定到了全局.
</li>
<li>The <b><b>Constructor</b></b> Invocation Pattern: 构造器调用: <code>new Func();</code>, this 绑定到了 new 出来的对象.
</li>
<li>The <b><b>Apply</b></b> Invocation Pattern: apply 调用: <code>func.apply(context, arguments)</code>, this 绑定到了第一个参数.
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 参数 / Arguments</h3>
<div class="outline-text-3" id="text-6-4">
<ul class="org-ul">
<li>arguments is 'array-like'
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 返回 / Return</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>函数总是返回, 如果没有返回值, 就返回 undefined
</li>
<li>new Func(), 如果 Func 返回的不是对象, 则返回 this (一个新对象)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> 异常 / Exceptions</h3>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> 给类型增加方法 / Augmenting Types</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li>Function.prototype.&lt;method&gt; = function(&#x2026;) {&#x2026;}
<div class="org-src-container">

<pre class="src src-js">Function.prototype.method = function (name, func) {
    if (!this.prototype[name]) {
        this.prototype[name] = func;
    }
}

// typeof Number === 'function'
Number.method('interger', function () {
    return Math[this &lt; 0 ? 'ceil' : 'floor'](this);
});
// (12.34).interger()

String.method('trim', function() {
    return this.replace(/^\s+|\s+$/g, '');
});
// " abc ".trim()
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> 递归 / Recursion</h3>
</div>
<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> 作用域 / Scope</h3>
</div>
<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> 闭包 / Closure</h3>
</div>
<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> 回调 / Callbacks</h3>
</div>
<div id="outline-container-sec-6-12" class="outline-3">
<h3 id="sec-6-12"><span class="section-number-3">6.12</span> 模块 / Module</h3>
<div class="outline-text-3" id="text-6-12">
<ul class="org-ul">
<li>closure
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-13" class="outline-3">
<h3 id="sec-6-13"><span class="section-number-3">6.13</span> 级联 / Cascade</h3>
<div class="outline-text-3" id="text-6-13">
<ul class="org-ul">
<li>就是 chaining
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-14" class="outline-3">
<h3 id="sec-6-14"><span class="section-number-3">6.14</span> 科里化 / Curry</h3>
<div class="outline-text-3" id="text-6-14">
<ul class="org-ul">
<li>better curry than java 8
<div class="org-src-container">

<pre class="src src-js">Function.method('curry', function() {
    var slice = Array.prototype.slice,
        args = slice.apply(arguments),
        that = this;
    return function() {
        return that.apply(null, args.concat(slice.apply(arguments)));
    };
});
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-15" class="outline-3">
<h3 id="sec-6-15"><span class="section-number-3">6.15</span> 记忆 / Memoization</h3>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 第 5 章 继承 / Inheritance</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> 伪类 / Pseudoclassical</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>构造器函数, 最好大写字母开头
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> 对象说明符 / Object Specifiers</h3>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> 原型 / Prototypal</h3>
</div>
<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> 函数化 / Functional</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li><del>给私有对象起一个奇怪的名字, 来防止别人使用它</del>
</li>
<li>如果对象的状态都是私有的, 则 tamper-proof (防伪)
</li>
<li>durable 的对象: 只有函数, 没有状态 (不会被入侵)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> 部件 / Parts</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 第 6 章 数组 / Arrays</h2>
<div class="outline-text-2" id="text-8">
<div class="tzx-summary"><strong>Summary</strong>
<ul class="org-ul">
<li>不是真正的 array, 只是 array-like (因为内存不连续)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 数组字面量 / Array Literals</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>[&#x2026;]
</li>
<li>{'0': &#x2026;, &#x2026;}
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> 长度 / Length</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>很容易形成空洞
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> 删除 / Delete</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>delete array[index]
</li>
<li>inplace cut off: array.splice(startPos, nElementToCutOff)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> 枚举 / Enumeration</h3>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> 混淆的地方 / Confusion</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li>[].constructor <code>=</code> Array
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> 方法 / Methods</h3>
<div class="outline-text-3" id="text-8-6">
<ul class="org-ul">
<li>reduce
<div class="org-src-container">

<pre class="src src-js">Array.method('reduce', function (f, value) {
    for (var i = 0; i &lt; this.length; i++) {
        value = f(this[i], value);
    }
    return value;
});
</pre>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> 维度 / Dimensions</h3>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 第 7 章 正则表达式 / Regular Expressions</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 一个例子 / An Example</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>regex.exec
</li>
<li>regex.test
</li>
<li>string.match
</li>
<li>string.replace
</li>
<li>string.search
</li>
<li>string.split
</li>
<li>不要尝试写一个大而全的 regex
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> 结构 / Construction</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li><code>/regex/</code>
</li>
<li>i, g, m
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> 元素 / Elements</h3>
<div class="outline-text-3" id="text-9-3">
</div><div id="outline-container-sec-9-3-1" class="outline-4">
<h4 id="sec-9-3-1"><span class="section-number-4">9.3.1</span> 正则表达式分支 / Regexp Choice</h4>
<div class="outline-text-4" id="text-9-3-1">
<ul class="org-ul">
<li>(a|b), choose a or b
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-2" class="outline-4">
<h4 id="sec-9-3-2"><span class="section-number-4">9.3.2</span> 正则表达式序列 / Regexp Sequence</h4>
<div class="outline-text-4" id="text-9-3-2">
<ul class="org-ul">
<li>regexp factor, regexp quantifier: x{min,max}
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-3" class="outline-4">
<h4 id="sec-9-3-3"><span class="section-number-4">9.3.3</span> 正则表达式因子 / Regexp Factor</h4>
<div class="outline-text-4" id="text-9-3-3">
<ul class="org-ul">
<li>regexp factor, regexp quantifier: x{min,max}
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9-3-4" class="outline-4">
<h4 id="sec-9-3-4"><span class="section-number-4">9.3.4</span> 正则表达式转义 / Regexp Escape</h4>
<div class="outline-text-4" id="text-9-3-4">
<ul class="org-ul">
<li>\d: digits, \D: non-digits
</li>
<li>\s: whitespaces, &sect;: non-whitespaces
</li>
<li>\b: boundry
</li>
<li>\1: captured group #1
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> 正则表达式分组 / Regexp Group</h3>
<div class="outline-text-3" id="text-9-4">
<ul class="org-ul">
<li>capturing
</li>
<li>noncapturing
</li>
<li>positive lookahead
</li>
<li>negative lookahead
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> 第 8 章 方法</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>这部分查文档
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 第 9 章 代码风格 / Style</h2>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 第 10 章 优美的特性 / Beautiful Features</h2>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 附录 A: 毒瘤 / Awful Parts</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>global variables: 没有 linker, 全局变量
</li>
<li>scope: 语法上有 block scope, 实际上没有
</li>
<li>semicolon insertion
</li>
<li>reserved words
</li>
<li>unicode
</li>
<li>typeof: <code>typeof null === object</code>
</li>
<li>parseInt, 小心进制问题, 尤其在处理时间上
</li>
<li>+ 不仅还是个单目运算符, 可以转化字符串成数字
</li>
<li>Floating point
</li>
<li>NaN: 是 number, isFinite
</li>
<li>Phony arrays
</li>
<li>Falsy values: 0, false, null, undefined, ' '
</li>
<li>undefined 和 NaN 是全局变量, 可能被修改, lodash 库里为了防止别人修改了这个值, 用 <code>var undefined;</code> 来保证它是 undefined.

<p>
令人惊讶的是所有的没有初始化对象都相等&#x2026;
</p>

<div class="org-src-container">

<pre class="src src-js">var x
// undefined
x
// undefined
var y
// undefined
x === y
// true
var undefined
// undefined
x === undefined
// true
</pre>
</div>
</li>
<li>hasOwnProperty
</li>
<li>Object
</li>
</ul>
</div>
</div>
